In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib as plt

In [41]:
df= pd.read_csv("work.csv")
df

     Name         city    age py-score
0    Emma      Kampala     23       90
1  Wilber        Mbale     26       75
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

In [42]:
print(df.head())
print(df.tail())

     Name         city  age py-score
0    Emma      Kampala   23       90
1  Wilber        Mbale   26       75
2   Robin         Gulu   25     mine
3   Tevor  Livingstone  NaN       89
4    Yeko       Tororo   20       94
     Name         city    age py-score
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

In [63]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      4 non-null      object
 1   city      4 non-null      object
 2   age       4 non-null      int64
 3   py-score  4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 160.0+ bytes
None

In [46]:
hade= df.dropna()
hade

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
2   Robin     Gulu  25     mine
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

In [47]:
#cleaning of data
#remove wrong data and in this case i am gonna delete the 
for j in df.index:
    if df.loc[j, "py-score"]== "mine":
        df.drop(j ,inplace= True)
        
df

     Name         city    age py-score
0    Emma      Kampala     23       90
1  Wilber        Mbale     26       75
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

#

In [49]:
#wrong formats by removing the row with null values
df.dropna(subset=['age'], inplace = True)
df

     Name     city    age py-score
0    Emma  Kampala     23       90
1  Wilber    Mbale     26       75
4    Yeko   Tororo     20       94
5  Miriam     Arua  Train      NaN
6   Jesca  Mbarara     21       84

In [50]:
#formatting wrong data
df.dropna(subset=['py-score'], inplace = True)
print(df.to_string())

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

In [54]:
#CORRELATIONS
df['age'] = pd.to_numeric(df['age'], errors='coerce')
df['py-score'] = pd.to_numeric(df['py-score'], errors='coerce')

# Calculate the correlation between the two rows
correlation = df['age'].corr(df['py-score'])

print("Correlation between 'age' and 'py-score':", correlation)
print(df.corr())

Correlation between 'age' and 'py-score': -0.8158910693878249
               age  py-score
age       1.000000 -0.815891
py-score -0.815891  1.000000

In [55]:
jati =pd.read_csv("mine.csv")
jati

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [65]:
print(jati.head())
print(jati.tail())
print(jati.info())

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0
     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB
None

In [69]:
abdu = jati.dropna()
sau =jati.fillna(2222)
print(jati)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

cleaning of data

wrong data

In [71]:
jati
jati.dropna()
print(jati.dropna())

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

In [72]:
correlation = jati.corr()
print(correlation)

          Duration     Pulse  Maxpulse  Calories
Duration  1.000000 -0.155408  0.009403  0.922717
Pulse    -0.155408  1.000000  0.786535  0.025121
Maxpulse  0.009403  0.786535  1.000000  0.203813
Calories  0.922717  0.025121  0.203813  1.000000